_posts/language/2022-04-07-english-irate.html
---
layout: post
title: 单词本：irate
categories: [language]
tags: [English]
---

<p>
昨天看了下预算成本分析技术，看到这句话：
</p>

<p>
Considering factors in addition to operating income, they should check
if they can step up their manufacturing efforts enough to support the
added sales. If they can&rsquo;t, the company could end up with very <b>irate</b>
customers in the months ahead.
</p>

<p>
当运营收入增加的时候，他们也要确认下是否有足够的生产能力满足增加的销售量，如果不能满足，公司会在几个月后面应付发怒的客户。
</p>

<p>
此处有个词 irate 是发怒的意思。这个词来自拉丁语 iratus：
</p>

<p>
Cum <b>iratus</b> es, deciens numera; cum furas, centiens. 当你生气的时候，数到10；当你愤怒的时候，数到100。
</p>

<p>
这里，我们看到拉丁语里的 deciens 在法语里是 dix，centiens 在法语里是
cent。还有 furas，英语里现在是 fury 狂怒。
</p>

<p>
不知道法语里 irrité 是不是也是从 iratus 演变来的：
</p>

<p>
Le vieux moine est devenu de nouveau irrité. 那个老僧侣又发怒了。
</p>


<p>
新闻：
</p>

<p>
2022-04-03: Dr. George Akuffo Dampare, Inspector-General of Police, on
Saturday visited Essiama and Nkroful in the Western Region, where some
irate youth attacked some state institutions Friday, including the
Essiama Divisional Police headquarters.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> 加纳西部愤怒的年轻人攻击政府机构，加纳的警察总长 George Akuffo Dampare 亲自前往。
</p>

<p>
同样这则新闻里，还有一句：
</p>

<p>
This infuriated the youth, who later besieged the Essiama police
station. 这个狂怒的年轻人，被关在了 Essiama 警察局。infuriate 这个词应该是前面提到的 fury 动词化后，再作形容词用。意思是 into fury state，进入狂怒状态。
</p>


<p>
总结：
</p>

<ul class="org-ul">
<li>irate 英语，发怒的</li>
<li>iratus 拉丁语，发怒的</li>
<li>fury 英语，狂怒的</li>
<li>furas 拉丁语，狂怒的</li>
<li>irrité 法语，发怒的</li>
<li>infuriate 英语，激怒</li>
</ul>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://www.gna.org.gh/1.21447988">https://www.gna.org.gh/1.21447988</a>
</p></div></div>


</div>
</div>
